In [1]:
import pandas as pd

pd.__version__

'1.5.3'

In [2]:
import numpy as np

np.__version__

'1.24.3'

In [3]:
import matplotlib

matplotlib.__version__

'3.7.1'

In [4]:
import scipy

scipy.__version__

'1.10.1'

In [5]:
import sklearn

sklearn.__version__

'1.2.2'

In [6]:
# pandas 불러오기
import pandas as pd

# k:v 구조를 갖는 딕셔너리를 만들고, 변수 dict_data에 저장
dict_data = {'a': 1, 'b': 2, 'c': 3}
dict_data

{'a': 1, 'b': 2, 'c': 3}

In [7]:
# 판다스 Series() 함수로 딕셔너리(dict_data)를 시리즈로 변환. 변수 sr에 저장
sr = pd.Series(dict_data)
# 변수 sr의 자료형 출력
print(type(sr))
# 변수 sr에 저장되어 있는 시리즈 객체를 출력
print('-' * 40)
print(sr)

<class 'pandas.core.series.Series'>
----------------------------------------
a    1
b    2
c    3
dtype: int64

In [8]:
# import pandas as pd

# 리스트를 시리즈로 변환하여 변수 sr에 저장
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
print(sr)
print('\n')

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [9]:
# 인덱스 배열은 변수 idx에 저장, 데이터 값 배열은 변수 val에 저장
idx = sr.index
val = sr.values
print(idx)
print('\n')
print(val)

RangeIndex(start=0, stop=5, step=1)


['2019-01-02' 3.14 'ABC' 100 True]

In [10]:
#imprt pandas as pd

# 투플을 시리즈로 변환(index 옵션에 인덱스 이름을 저장)
tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별','학생여부'])
print(sr)
print('\n')

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [12]:
# 원소를 1개 선택 
print(f'sr의 1번째 원소를 선택 (정수형 위치 인덱스를 활용)-> {sr[0]}')
print(f"'이름' 라벨을 가진 원소를 선택 (인덱스 이름을 활용)-> {sr['이름']}")

sr의 1번째 원소를 선택 (정수형 위치 인덱스를 활용)-> 영인
'이름' 라벨을 가진 원소를 선택 (인덱스 이름을 활용)-> 영인

In [13]:
# 여러 개의 원소를 선택 (인덱스 리스트 활용)
print(sr[[0, 2]])
print('\n')
print(sr[['생년월일', '성별']])

이름    영인
성별     여
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

In [14]:
import pandas as pd

# 열이름을 key로 하고, 리스트를 value로 갖는 딕셔너리 정의(2차원 배열)
dict_data = {'c0': [1, 2, 3], 'c1': [4, 5, 6],'c2': [7, 8, 9], 'c3': [10, 11, 12], 'c4': [13, 14, 15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [16]:
# 판다스 DataFrame()함수로 딕셔너리 ... 진도 넘 빠르다
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [17]:
# df의 자료형 출력
print(type(df))
print('\n')
# 변수 .. 또 놓침

<class 'pandas.core.frame.DataFrame'>

In [20]:
#import pandas as pd

# 행 인덱스/열 이름 지정하여, 데이터프레임 만들기
df = pd.DataFrame([[15, '남', '덕명중'],
                  [17, '여', '수리중']],
                  index = ['준서', '예은'],
                  columns = ['나이', '성별', '학교'])
df

    나이 성별   학교
준서  15  남  덕명중
예은  17  여  수리중

In [ ]:
# 한개 또 놓침 ㅎㅎ
# 알고 싶으면 옆자리 참고하기 -> 귀찮아서 안 적음

In [22]:
# 행 인덱스, 열 이름 변경하기 
df.index = ['학생1', '학생2']
df.columns = ['연령', '남녀', '소속']

display(df)   # 데이터 프레임
print('\n')
print(df.index)   # 행 인덱스
print('\n')
print(df.columns)   # 열 이름

     연령 남녀   소속
학생1  15  남  덕명중
학생2  17  여  수리중

Index(['학생1', '학생2'], dtype='object')


Index(['연령', '남녀', '소속'], dtype='object')

In [26]:
# 열 이름 중, '연령'을 '나이'로, '남여'를 '성별'로, '소속'을 '학교'로 바꾸기
df.rename(columns = {'연령': '나이', '남여': '성별', '소속': '학교'})

# df의 행 인덱스 중에서, '학생1'을 '준서'로, '학생2'를 '예은'으로 바꾸기
df.rename(index = {'학생1': '준서', '학생2': '예은'}, inplace=True)
df

    연령 남녀   소속
준서  15  남  덕명중
예은  17  여  수리중

In [1]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'수학': [90, 80, 70], '영어': [98, 89, 95],
            '음악': [85, 95, 100], '체육': [100, 90, 90]}

df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [2]:
df1 = df
print(id(df))
print(id(df1))

2565591944784
2565591944784

In [3]:
# 데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개 행(row)을 삭제
df2 = df.copy()
df2.drop('우현', inplace=True)
print(id(df))
print(id(df2))
df2

2565591944784
2565618674832

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [4]:
# 데이터프레임 df를 복제하여 변수 df3에 저장. df3의 1개 행(row)을 삭제
df3 = df.copy()
df3.drop(['우현', '인아'], inplace=True)   # df3 = df3.drop(['우현', '인아'])
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [5]:
# 데이터프레임 df를 복제하여 변수 df4에 저장. df4의 1개 열(column)을 삭제
df4 = df.copy()
df4.drop('수학', axis=1, inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [9]:
# 행 인덱스를 사용하여 행 1개를 선택 
label1 =df.loc['서준']   #loc 인덱서 활용
position1 = df.iloc[0]   #iloc 인덱서 활용
print('label1(loc)')
display(label1)

print('-' * 40)

print('position(iloc)')
display(position1)

label1(loc)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

----------------------------------------
position(iloc)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [18]:
# 행 인덱스를 사용하여 2개 이상의 행 선택
label2 = df.loc[['서준', '우현']]
position2 = df.iloc[[0, 1]]

print('label2(loc)')
display(label2)

print('-' * 40)

print('position2(iloc)')
display(position2)

label2(loc)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

----------------------------------------
position2(iloc)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [13]:
# 행 인덱스의 범위를 지정하여 행 선택
label3 = df.loc['서준': '우현']
position3 = df.iloc[0: 1]

print('label3(loc)')
display(label3)

print('-' * 40)

print('position3(iloc)')
display(position3)

label3(loc)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

----------------------------------------
position3(iloc)

    수학  영어  음악   체육
서준  90  98  85  100

In [14]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [15]:
# '수학' 점수 데이터만 선택, 변수 math1에 저장
math1 = df['수학']
math1

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [16]:
# '영어' 점수 데이터만 선택, 변수 english에 저장
english = df.영어
english

서준    98
우현    89
인아    95
Name: 영어, dtype: int64

In [19]:
# '음악', '체육' 점수 데이터를 선택. 변수 music_gum에 저장
music_gum = df[['음악', '체육']]
music_gum

     음악   체육
서준   85  100
우현   95   90
인아  100   90

In [20]:
# '수학' 점수 데이터만 선택, 변수 math2에 저장
math2 =df[['수학']]
math2

    수학
서준  90
우현  80
인아  70

In [22]:
df.iloc[::2]   # 0행부터 2행 간격으로 선택

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [25]:
df.iloc[0:3:2]   # 0행부터 2행까지 2행 간격

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [26]:
df.iloc[::-1]   # df의 모든 행을 선택하여 역순으로 정렬

    수학  영어   음악   체육
인아  70  95  100   90
우현  80  89   95   90
서준  90  98   85  100

In [27]:
# import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름': ['서준', '우현', '인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [28]:
# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [29]:
# 데이터프레임 df의 특정 원소 1개 선택('서준'의 '음악' 점수)
a = df.loc['서준', '음악']
a

85

In [31]:
# 데이터프레임 df의 특정 원소 2개 선택('서준'의 '음악', '체육' 점수)
c = df.loc['서준', ['음악', '체육']]
c

음악     85
체육    100
Name: 서준, dtype: int64

In [34]:
d0 = df.iloc[0,2]
print('df.iloc[0, 2]\n', d0)
d = df.iloc[0, [2, 3]]
print('df.iloc[0, [2, 3]]\n', d)

df.iloc[0, 2]
 85
df.iloc[0, [2, 3]]
 음악     85
체육    100
Name: 서준, dtype: int64

In [36]:
e = df.loc['서준', '음악': '체육']
e

음악     85
체육    100
Name: 서준, dtype: int64

In [38]:
f = df.iloc[0, 2:]
f

음악     85
체육    100
Name: 서준, dtype: int64

In [39]:
# df의 2개 이상의 행과 열로부터 원소 선택('서준', '우현'의 '음악', '체육' 점수)
g = df.loc[['서준', '우현'], ['음악', '체육']]
g

    음악   체육
이름
서준  85  100
우현  95   90

In [40]:
h = df.iloc[[0, 1], [2, 3]]
h

    음악   체육
이름
서준  85  100
우현  95   90

In [41]:
i = df.loc['서준': '우현', '음악': '체육']
i

    음악   체육
이름
서준  85  100
우현  95   90

In [42]:
j = df.iloc[0:2, 2:]
print(j)

    음악   체육
이름
서준  85  100
우현  95   90

In [43]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [45]:
# 데이터프레임 df에 '국어' 점수 열(colum)을 추가. 데이터 값은 80 지정
df['국어'] = 80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  90
인아  70  95  100   90  80

In [46]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름': ['서준', '우현', '인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [47]:
# 새로운 행(row)을 추가 - 같은 원소 값을 입력 
df.loc[3] = 0
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

In [48]:
# 새로운 행(row)을 추가 - 원소 값 여러 개의 배열 입력
df.loc[4] = ['동규', 90, 80, 70, 60]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60

In [49]:
# 새로운 행(row)을 추가 - 기존 행 복사
df.loc['행5'] = df.loc[3]
df

    이름  수학  영어   음악   체육
0   서준  90  98   85  100
1   우현  80  89   95   90
2   인아  70  95  100   90
3    0   0   0    0    0
4   동규  90  80   70   60
행5   0   0   0    0    0

In [53]:
df.loc[3: '행5']

    이름  수학  영어  음악  체육
3    0   0   0   0   0
4   동규  90  80  70  60
행5   0   0   0   0   0

In [55]:
df.iloc[3: 5]

   이름  수학  영어  음악  체육
3   0   0   0   0   0
4  동규  90  80  70  60

In [59]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름': ['서준', '우현', '인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [60]:
# 데이터프레임 df의 특정 원소를 변경하는 방법: '서준'의 '체육' 점수
df.iloc[0][3] = 80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [61]:
df.loc['서준']['체육'] = 90
df

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [62]:
df.loc['서준', '체육'] = 100
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [63]:
# 데이터프레임 df의 원소 여러 개를 변경하는 방법: '서준'의 음악, '체육' 점수
df.loc['서준', ['음악', '체육']] = 50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [64]:
df.loc['서준', ['음악', '체육']] = 100, 50
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

In [66]:
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [67]:
# 데이터프레임 df를 전치하기 (메소드 활용)
df = df.transpose()
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [68]:
# 데이터프레임 df를 다시 전치하기 (클래스 속성 활용)
df = df.T
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [73]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름': ['서준', '우현', '인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [74]:
# 특정 열(column)을 데이터프레임의 행 인덱스(index)로 설정
ndf = df.set_index(['이름'])
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [75]:
ndf2 = ndf.set_index('음악')
ndf2

     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90

In [77]:
ndf3 = ndf.set_index(['수학', '음악'])
ndf3

        영어   체육
수학 음악
90 85   98  100
80 95   89   90
70 100  95   90

In [85]:
# 딕셔서리 정의
dict_data = {'c0': [1, 2, 3], 'c1': [4, 5, 6], 'c2': [7, 8, 9],
            'c3': [10, 11, 12], 'c4': [13, 14, 15]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [86]:
# 인덱스를 [r0, r1, r2, r3, r4]로 재지정
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [87]:
# reindex로 발생한 NaN값을 숫자 0으로 채우기 
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [89]:
# 딕셔서리를 데이터플레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [90]:
# 행 인덱스를 정수형으로 초기화
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [91]:
df.reset_index(drop=True)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [92]:
# 딕셔서리를 데이터플레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [93]:
# 내림차순으로 행 인덱스 정렬
ndf = df.sort_index(ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [95]:
ndf.sort_index()   #ascending 옵션이 생략되면 오름차순 기본 적용

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [96]:
ndf.sort_index(ascending=True)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [97]:
ndf = df.sort_values(by='c1', ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [98]:
# 딕셔너리 데이터로 판다스 시리즈 만들기 
student1 = pd.Series({'국어': 100, '영어': 80, '수학': 90})

display(student1)

국어    100
영어     80
수학     90
dtype: int64

In [100]:
# 학생의 과목별 점수를 200으로 나누기 
percentage = student1 / 200

display(percentage)

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [101]:
# 딕셔너리 데이터로 판다스 시리즈 만들기 
student1 = pd.Series({'국어': 100, '영어': 80, '수학': 90})
student2 = pd.Series({'수학': 80, '국어': 90, '영어': 80})

display(student1)
print('-' * 40)
display(student2)

국어    100
영어     80
수학     90
dtype: int64

----------------------------------------

수학    80
국어    90
영어    80
dtype: int64

In [106]:
# 두 학생의 과목별 점수로 사칙연산 수행 
addition = student1 + student2   # 덧셈
subtraction = student1 - student2   # 뺄셈
multiplication = student1 * student2   #곱셈
division = student1 / student2   # 나눗셈
print(type(division))

<class 'pandas.core.series.Series'>

In [107]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([addition, subtraction, multiplication, division],
                     index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
display(result)

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [108]:
import numpy as np

student1 = pd.Series({'국어':np.nan, '영어': 80, '수학': 90})
student2 = pd.Series({'수학': 80, '국어': 90})

display(student1)
print('-' * 40)
display(student2)

국어     NaN
영어    80.0
수학    90.0
dtype: float64

----------------------------------------

수학    80
국어    90
dtype: int64

In [109]:
# 두 학생의 과목별 점수로 사칙연산 수행 
addition = student1 + student2   # 덧셈
subtraction = student1 - student2   # 뺄셈
multiplication = student1 * student2   #곱셈
division = student1 / student2   # 나눗셈
print(type(division))

<class 'pandas.core.series.Series'>

In [110]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([addition, subtraction, multiplication, division],
                     index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
display(result)

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [111]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':np.nan, '영어': 80, '수학': 90})
student2 = pd.Series({'수학': 80, '국어': 90})

In [114]:
# 두 학생의 과목별 점수로 사칙연산 수행 (연산 메소드 사용)
sr_add = student1.add(student2, fill_value=0)   # 덧셈
sr_sub = student1.sub(student2, fill_value=0)   # 뺄셈
sr_mul = student1.mul(student2, fill_value=0)   # 곱셈
sr_div = student1.div(student2, fill_value=0)   # 나눗셈

# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
                      
result

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

In [115]:
# 라이브러리 불러오기
import seaborn as sns

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [116]:
df = titanic.loc[:, ['age', 'fare']]

df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [117]:
# 데이터프레임에 숫자 10 더하기
addition = df + 10

addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [120]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [121]:
# 데이터프레임에 숫자 10 더하기 ... 안 더해진 것 같음 -> 확인 다시해보기 
addition = df + 10
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [122]:
# 놓침